src/InformationRegisters/BusinessProcessData.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>BusinessProcessData</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Completed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Started</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CompletionDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeletionMark</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>BusinessProcess</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/BusinessProcessesAndTasksEvents/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Business processes and tasks subsystem
//  
////////////////////////////////////////////////////////////////////////////////

#Region InternalProceduresAndFunctions

////////////////////////////////////////////////////////////////////////////////
// Subsystem event subscription handlers.

// Handler for WriteToBusinessProcessList event subscription.
//
Procedure WriteToBusinessProcessList(Source, Cancel) Export
	
	If Source.DataExchange.Load Then 
        Return;  
	EndIf; 
	
	RecordSet = InformationRegisters.BusinessProcessData.CreateRecordSet();
	RecordSet.Filter.BusinessProcess.Value = Source.Ref;
	RecordSet.Filter.BusinessProcess.Use = True;
	Write = RecordSet.Add();
	Write.BusinessProcess = Source.Ref;
	FieldList = "Number,Date,Completed,Started,Author,CompletionDate,Description,DeletionMark";
	FillPropertyValues(Write, Source, FieldList);
	
	BusinessProcessesAndTasksOverridable.OnWriteBusinessProcessList(Write);
	
	SetPrivilegedMode(True);
	RecordSet.Write();

EndProcedure

// Handler for SetTaskDeletionMarks event subscription.
//
Procedure SetTaskDeletionMarks(Source, Cancel) Export
	
	If Source.DataExchange.Load Then 
        Return;  
	EndIf; 
	
	If Source.IsNew() Then 
        Return;  
	EndIf; 
	
	PreviousDeletionMark = CommonUse.ObjectAttributeValue(Source.Ref, "DeletionMark");
	If Source.DeletionMark <> PreviousDeletionMark Then
		SetPrivilegedMode(True);
		BusinessProcessesAndTasksServer.SetTaskDeletionMarks(Source.Ref, Source.DeletionMark);
	EndIf;	
	
EndProcedure

// Handler for UpdateBusinessProcessState event subscription.
//
Procedure UpdateBusinessProcessState(Source, Cancel) Export
	
	If Source.DataExchange.Load Then 
        Return;  
	EndIf; 
	
	If Source.Metadata().Attributes.Find("State") = Undefined Then
		Return;
	EndIf;	
	
	If Not Source.IsNew() Then
		NewState = Source.State;
		OldState = CommonUse.ObjectAttributeValue(Source.Ref, "State");
		If NewState <> OldState Then
			BusinessProcessesAndTasksServer.OnChangeBusinessProcessState(Source, OldState, NewState);
		EndIf;
	EndIf;	
	
EndProcedure

#EndRegion
